<?php

return [

    /*
     | --------------------------------------------------------------------------
     | URI сервиса B2B API
     | --------------------------------------------------------------------------
     |
     | Базовый URI, по которому находится API B2B сервиса.
     */
    'api_base_uri' => env('B2B_API_BASE_URI', 'https://b2bapi.avtocod.ru/b2b/api/v1'),

    /*
     | --------------------------------------------------------------------------
     | Домен пользователя
     | --------------------------------------------------------------------------
     |
     | Домен учётной записи, которая используется для взаимодействия с B2B
     | сервисом.
     */
    'domain'       => env('B2B_API_CLIENT_DOMAIN', '%set_your_domain_here%'),

    /*
     | --------------------------------------------------------------------------
     | Имя пользователя
     | --------------------------------------------------------------------------
     |
     | Имя пользователя учётной записи, которая используется для взаимодействия
     | с B2B сервисом.
     */
    'username'     => env('B2B_API_CLIENT_USERNAME', '%set_your_username_here%'),

    /*
     | --------------------------------------------------------------------------
     | Пароль пользователя
     | --------------------------------------------------------------------------
     |
     | Пароль пользователя учётной записи, которая используется для
     | взаимодействия с B2B сервисом. В открытом виде пароль не передаётся,
     | используется для генерации токена авторизации.
     */
    'password'     => env('B2B_API_CLIENT_PASSWORD', '%set_your_password_here%'),

    /*
     | --------------------------------------------------------------------------
     | Типы отчетов
     | --------------------------------------------------------------------------
     |
     | В данной секции описываются настройки типов отчётов, доступных для работы.
     | Обязательным является ключ `uids`.
     */
    'report_types' => [

        /*
         | ----------------------------------------------------------------------
         | UID-ы типов отчетов
         | ----------------------------------------------------------------------
         |
         | Описываются в формате:
         |
         | <code>
         |   '%внутренний_алиас_типа_отчёта%' => [
         |       'uid'         => '%uid_ипа_отчета%',
         |       'description' => '%его_описание%',
         |   ]
         | </code>
         */
        'uids'           => [
            'default'  => [
                'uid'         => '%some_report_type_uid_here%',
                'description' => 'Some report type description',
            ],
            'extended' => [
                'uid'         => '%one_more_report_type_uid%',
                'description' => 'One more report type description',
            ],
        ],

        /*
         | ----------------------------------------------------------------------
         | Тип отчета, используемый по умолчанию
         | ----------------------------------------------------------------------
         |
         | Должен присутствовать в ключах массиве 'uids' (алиас должен
         | существовать).
         */
        'use_as_default' => env('B2B_API_DEFAULT_REPORT_TYPE', 'default'),

    ],

    /*
     | --------------------------------------------------------------------------
     | WebHooks
     | --------------------------------------------------------------------------
     |
     | URI, по которым будут отправляться уведомления от сервиса B2B API.
     | Уведомления приходят в виде POST запросов. Подробнее о составе
     | отправляемых данных читайте в документации.
     |
     | See: <https://b2bapi.avtocod.ru/doc/integration.md>
     |
     | Возможные значения: %uri_string%|null
     */
    'webhooks'     => [
        'on' => [
            'complete' => env('B2B_API_WEBHOOK_ON_COMPLETE', null),
            'update'   => env('B2B_API_WEBHOOK_ON_UPDATE', null),
        ],
    ],

    /*
     | --------------------------------------------------------------------------
     | Режим тестирования
     | --------------------------------------------------------------------------
     |
     | Состояние режима тестирования, при включении которого происходит лишь
     | эмуляция запросов, вместо их реального выполнения.
     |
     | Возможные значения: true|false
     */
    'is_test' => (bool) env('B2B_API_IS_TEST', false),

];
